<script setup lang="ts"></script>

<template>
	<div class="content">
		<h2>
			1. Что такое семантические теги HTML, и почему их важно использовать?
		</h2>
		<ul>
			<li>
				Должен упомянуть, что семантические теги передают смысл содержимого.
				Разные уровни заголовков, article - самостоятельный блок, section -
				группировка раздела, nav - навигационный блок и тп
			</li>
			<li>
				Как семантика влияет на доступность(скринридеры), сео, структурирование
				кода
			</li>
			<li>Примеры: отличие семантического тега section от article</li>
		</ul>

		<h2>2. Чем отличается атрибут id от атрибута class?</h2>
		<ul>
			<li>
				id должен быть уникальным для страницы, а одинаковый class может
				применяться к нескольким элементам. class используется чаще всего для
				задания стилей
			</li>
			<li>Использование id для уникализации элемента</li>
			<li>Использование class для группировки и стилизации</li>
		</ul>

		<h2>3. Какие атрибуты можно использовать для ссылки (a)?</h2>
		<ul>
			<li>
				Упоминание основных атрибутов: href (адрес ссылки), target (например,
				_blank), rel (например, noopener, nofollow)(опционально)
			</li>
			<li>
				Зачем использовать target="_blank"? Вместе с rel="noopener" для
				безопасности?
			</li>
			<li>Что такое абсолютная ссылка(полный URL), а что относительная?</li>
		</ul>

		<h2>4. Что такое атрибуты в HTML, и для чего они используются?</h2>
		<ul>
			<li>Атрибуты — это дополнительные параметры тега</li>
			<li>
				Привести примеры часто используемых атрибутов, таких как href (для
				ссылок), src (для изображений), alt, id, class
			</li>
			<li>data-атрибуты и как с ними работать</li>
		</ul>
	</div>
</template>

<style scoped>
*:not(:first-child) {
	margin-top: 20px;
}
ul {
	padding-left: 20px;
}
</style>
