<script setup lang="ts">
import { onMounted } from 'vue'
</script>

<template>
	<div class="content">
		<h2>1. Что такое virtual DOM?</h2>
		<ul>
			<li>
				Рассказать о том, что это "виртуальная копия" реальнго DOM дерева
				хранимая в памяти
			</li>
			<li>Используется для того, чтобы оптимизировать работу с реальным DOM</li>
			<li>
				Происходящие изменения(отрисовки состоянии) проихсодят сперва в
				виртуальном, далее сравнение с реальным и точечное обновление изменений,
				а не всей пачки
			</li>
			<li>
				к примеру было в списке 10 пунктов и один мы удалили, благодаря умной
				работе фреймворка с виртуальным дом у нас произойдет 1 изменение, а не
				перерендер всех 10 пунктов
			</li>
		</ul>

		<h2>2. Что такое компоненты? Что такое рактивность?</h2>
		<ul>
			<li>
				Рассказать о том, что это файлы .vue которые содержат в себе
				верстку/логику/стили
			</li>
			<li>Реактивность - отслеживание состояние переменных и изменение UI.</li>
		</ul>

		<h2>3. Как передавать данные и события между компонентами ?</h2>
		<ul>
			<li>Рассказать про props, emits</li>
			<li>Рассказать про provide/inject</li>
			<li>Рассказать про state manager</li>
		</ul>

		<h2>4. Что такое хуки жизненного цикла?</h2>
		<ul>
			<li>
				Рассказать что это цикл жизни компонента, назвать несколько из списка -
				beforeCreate, created, beforeMounted, mounted, beforeUpdate, updated,
				beforeUnmount, unmounted
			</li>
			<li>Рассказать для чего используется несколько из них</li>
		</ul>

		<h2>5. Что такое условный рендеринг и какие варианты работы с ним?</h2>
		<ul>
			<li>Рассказать про v-if, v-show и разницу между ними</li>
		</ul>

		<h2>6. Как отрисовать несколько компонентов в цикле, что такое v-for?</h2>
		<ul>
			<li>Какие особенности при работе с v-for? нужен key</li>
			<li>для чего нужен key</li>
		</ul>

		<h2>7. Что такое v-bind, v-model, v-on?</h2>
		<ul>
			<li>
				v-bind динамическая привязка аттрибутов к html с мозможностью изменения.
				например :class, :id
			</li>
			<li>
				v-model двусторонее связывание состояние шаблона и компонента, так же
				передача состояние наверх. например input
			</li>
			<li>
				v-on привязка событий html к шаблону, таких как клик, ввод, отправка
				формы и тд. так же событие может быть кастомных. может иметь
				модификаторы
			</li>
		</ul>

		<h2>8. Что такое слоты ?</h2>
		<ul>
			<li>
				Способ передачи в дочерний компонент шаблон/верстку/компонент с помощью
				slot в дочернем компоненте
			</li>
			<li>Что такое именование слоты и как с ними работать</li>
			<li>Как указать контент по умолчанию, если слот не заполнен</li>
		</ul>

		<h2>9. Что такое computed?</h2>
		<ul>
			<li>
				Рассказать вычисляемое свойство, которое реактивно от входящих
				аргументов
			</li>
			<li>
				Можно ли самостоятельно изменить состояние computed? Да, через get,set,
				но этот подход не рекомендуется
			</li>
			<li>Какие значения отслеживает вычислямое свойство</li>
		</ul>

		<h2>10. Что такое watch, watchEffect?</h2>
		<ul>
			<li>Используется для отслеживания изменений реактивного состояния</li>
			<li>
				Watch принимает реактивную переменную или геттер, второй колбек получает
				новое и старое значение
			</li>
			<li>
				Используется для отслеживания состояние и реакции на них, например дла
				асинхронных запросов при пагинации
			</li>
			<li>
				В чем отличие от watchEffect? watchEffect записывается без передачи
				первого агрумента, а отслеживает все зависимые входящие в колбек
				реактивные данные
			</li>
		</ul>
	</div>
</template>

<style scoped>
*:not(:first-child) {
	margin-top: 20px;
}
ul {
	padding-left: 20px;
}
</style>
